#include <gtest/gtest.h>
//#include <complex>
#include <vector>
#include "Complex.h"
#include "Signal.h"
#include "Class_declarations.h"

TEST(test_demodulator, AM) {
    // Подготовка тестовых данных
    int Fs = 24000; // Из названия
    Signal input;
    // Комплексные пары. IQ из Matlab
    input.signal =
            {
                    {-1582, -10410},
                    {-2645, -13744},
                    {-1484, -8880},
                    {-1959, -10072},
                    {-1621, -8090},
                    {-403,  -2759},
                    {-1177, -6065},
                    {-1973, -9783},
                    {-2702, -12281},
                    {-1612, -8474},
                    {-2570, -11735},
                    {-5893, -23281},
                    {-3934, -17203},
                    {-1513, -9494},
                    {-1907, -10867},
                    {-3400, -16382}
                    //
            };


    std::vector<float> expected = {-0.196809609283215, 0.0146781822717867, -0.289927492270986, -0.213206637993361,
                                   -0.335824964200954, -0.669071338956204, -0.462268951428094, -0.230335455565709};

    // Вызов тестируемой функции
    Factory factory;
    Demodulator *demod = factory.create("AM", Fs);
    std::vector<float> actual = demod->getDemodulatedSignal(input); // Вызовется DemodulatorAM::getDemodulatedSignal

    // Проверка результата
    EXPECT_EQ(actual, expected);
}


TEST(test_demodulator, FM) {
    // Подготовка тестовых данных
    int Fs = 24000; // Из названия
    Signal input;
    input.signal =
            {
                    {-609,  -1085},
                    {4322,  -5282},
                    {745,   224},
                    {732,   -1403},
                    {4747,  -2006},
                    {513,   1357},
                    {-803,  -1051},
                    {-5506, -70},
                    {-2163, 1950},
                    {304,   1194},
                    {-3635, 1858},
                    {-3676, -1076},
                    {-259,  408},
                    {-4309, 6292},
                    {-1829, 2912},
                    {-2243, -109}
                    //
            };


    std::vector<float> expected = {0.381096691, 0.37468496, -0.439901918, 0.219663501,
                                   0.512223542, 0.907382488, -0.288283139, -0.237578899};

    // Вызов тестируемой функции
    Factory factory;
    Demodulator *demod = factory.create("FM", Fs);
    std::vector<float> actual = demod->getDemodulatedSignal(input); // Вызовется DemodulatorAM::getDemodulatedSignal

    // Проверка результата
    EXPECT_EQ(actual, expected);
}


TEST(test_demodulator, USB) {
    int Fs = 24100;
    Signal input;
    // У USB сигнала только Q составляющая
    input.signal =
            {
                    {0, -0.00494384765625000},
                    {0, -0.0179443359375000},
                    {0, -0.00973510742187500},
                    {0, -0.0142822265625000},
                    {0, -0.0226135253906250},
                    {0, 0.00378417968750000},
                    {0, 0.0191955566406250},
                    {0, -0.0111694335937500},
                    {0, -0.00292968750000000},
                    {0, -0.00787353515625000},
                    {0, 0.00335693359375000},
                    {0, 0.00436401367187500},
                    {0, 0.00976562500000000},
                    {0, 0.0241088867187500},
                    {0, 0.00720214843750000},
                    {0, -0.000823974609375000}
                    //
            };


    std::vector<float> expected = {0, -0.00519346359308415, 0.00529951770492911, -0.0187890823900205,
                                   0.00554447469551788, -0.00902006528627461, 0.0112854762958672,
                                   -0.0108507409846694};

    // Вызов тестируемой функции
    Factory factory;
    Demodulator *demod = factory.create("USB", Fs);
    std::vector<float> actual = demod->getDemodulatedSignal(input); // Вызовется DemodulatorAM::getDemodulatedSignal


    EXPECT_EQ(actual, expected);
}

TEST(test_demodulator, LSB) {
    int Fs = 24000;
    Signal input;
    // У LSB сигнала только I составляющая
    input.signal =
            {
                    {-0.0645141601562500,  0},
                    {0.0259399414062500,   0},
                    {0.063659667968750,    0},
                    {-0.0487670898437500,  0},
                    {0.0152282714843750,   0},
                    {-0.00320434570312500, 0},
                    {0.0305480957031250,   0},
                    {0.0143432617187500,   0},
                    {0.0682067871093750,   0},
                    {0.0429382324218750,   0},
                    {-0.0811157226562500,  0},
                    {-0.0130920410156250,  0},
                    {0.00436401367187500,  0},
                    {-0.00109863281250000, 0},
                    {0.00946044921875000,  0},
                    {-0.0325012207031250,  0}
                    //
            };


    std::vector<float> expected = {-0.0828677236880247, 0.0788733735296948, 0.0168717796446551, 0.0276704154860004,
                                   0.0437189368511365, -0.0270051076361036, -5.65832331936154,
                                   -0.00319956388214098};

    // Вызов тестируемой функции
    Factory factory;
    Demodulator *demod = factory.create("LSB", Fs);
    std::vector<float> actual = demod->getDemodulatedSignal(input); // Вызовется DemodulatorAM::getDemodulatedSignal


    EXPECT_EQ(actual, expected);
}


// Ожидаемый результат
/*
Signal expected;
expected.signal =
        {
                {-1582, -10410},  // О
                {-2645, -13744},  //
                {-1484, -8880},  //
                {-1959, -10072},
                {-1621, -8090},
                {-403,  -2759},
                {-1177, -6065},
                {-1973, -9783},
                {-2702, -12281},
                {-1612, -8474},
                {-2570, -11735},
                {-5893, -23281},
                {-3934, -17203},
                {-1513, -9494},
                {-1907, -10867},
                {-3400, -16382}
                //
        };
*/